// 1. Какое последнее значение выведет этот код? Почему?
//
// let i = 3;
//
// while (i) {
//   alert( i-- );
// }
// Ответ: 1, значение переменнной будет равно 0, когда alert выведет 1 и цикл остановится

// 2. Выведите чётные числа
// При помощи цикла for выведите чётные числа от 2 до 10.
for (let i = 2; i <= 10; i++) {
    if (i % 2 === 0) {
        alert(i);
    }
}
//Замените for на while
// Перепишите код, заменив цикл for на while, без изменения поведения цикла.
//
// for (let i = 0; i < 3; i++) {
//   alert( `number ${i}!` );
// }
let i = 0;
while (i < 3) {
    alert(`number ${i}!`);
    i++;
}