// Кнопка вверх/вниз
// Создайте кнопку «наверх», чтобы помочь с прокруткой страницы.
//
// Она должна работать следующим образом:
//
// Пока страница не прокручена вниз хотя бы на высоту окна – кнопка невидима.
// Когда страница прокручена вниз больше, чем на высоту окна – появляется стрелка «наверх» в левом верхнем углу. Если страница прокручивается назад, стрелка исчезает.
// Когда нажимается стрелка, страница прокручивается вверх.
// Как тут (слева-сверху, прокрутите):

arrowTop.onclick = () => {
    window.scrollTo(0, 0);
};
window.addEventListener('scroll', () => {
    arrowTop.hidden = window.scrollY < document.documentElement.clientHeight;
});