// Найдите координаты точек относительно окна браузера
// В ифрейме ниже располагается документ с зелёным «полем».
//
// Используйте JavaScript, чтобы найти координаты углов, обозначенных стрелками.
//
// В документе уже реализована функциональность, когда при клике на любом месте показываются соответствующие координаты.
//
//
// Ваш код должен при помощи DOM получить четыре пары координат:
//
// верхний левый, внешний угол (это просто).
// нижний правый, внешний угол (тоже просто).
// верхний левый, внутренний угол (чуть сложнее).
// нижний правый, внутренний угол (есть несколько способов, выберите один).
// Координаты, вычисленные вами, должны совпадать с теми, которые возвращаются по клику мыши.
//
// P.S. Код должен работать, если у элемента другие размеры или есть рамка, без привязки к конкретным числам.


// Внешние углы

let coords = element.getBoundingClientRect();

let a = [coords.left, coords.top];
let b = [coords.right, coords.bottom];

//Верхний левый внутренний угол
let c = [coords.left + field.clientLeft, coords.top + field.clientTop];

// Нижний правый внутренний угол

let d = [
    coords.left + element.clientLeft + element.clientWidth,
    coords.top + element.clientTop + element.clientHeight
];