//Найти размер прокрутки снизу
// Свойство elem.scrollTop содержит размер прокрученной области при отсчёте сверху. А как подсчитать размер прокрутки снизу (назовём его scrollBottom)?
//
// Напишите соответствующее выражение для произвольного элемента elem.
//
// P.S. Проверьте: если прокрутки нет вообще или элемент полностью прокручен – оно должно давать 0.

let scrollBottom = element.scrollHeight - element.scrollTop - element.clientHeight;




//В чём отличие CSS-свойств width и clientWidth
// В чём отличие между getComputedStyle(elem).width и elem.clientWidth?
//
// Укажите хотя бы 3 отличия, лучше – больше.

//
// clientWidth возвращает число, а getComputedStyle(elem).width – строку с px в конце.
// getComputedStyle не всегда даст ширину, он может вернуть "auto" для строчного элемента.
// clientWidth соответствует внутренней области элемента, включая внутренние отступы padding, а CSS-ширина соответствует внутренней области без внутренних отступов padding.